Examinator/src/InformationRegisters/ВыданныеПинКодыСУО/ВыданныеПинКодыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыданныеПинКодыСУО</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеПоказано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоказаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдавший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииПинКодовСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВыданныеПинКодыСУО/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор <> Неопределено
		И Параметры.Отбор.Свойство("Серия")
		И ЗначениеЗаполнено(Параметры.Отбор.Серия) Тогда
		
		Серия = Параметры.Отбор.Серия;
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(ЭтотОбъект, "Серия", Ложь);
		
	Иначе
		
		Элементы.ФормаСформировать.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Сформировать(Команда)
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	
	КЧ = Новый КвалификаторыЧисла(12,0, ДопустимыйЗнак.Неотрицательный);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	
	Оповещение =  Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);
		
	ПоказатьВводЗначения(Оповещение, 1000, НСтр("ru = 'Количество кодов для создания'"), ОписаниеТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(КоличествоКодов, Параметры) Экспорт
    Если КоличествоКодов <> Неопределено Тогда
		СформироватьНаСервере(КоличествоКодов);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(КоличествоКодов)
	
	РегистрыСведений.ВыданныеПинКодыСУО.СоздатьКодыСерии(Серия, КоличествоКодов);	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьКакВыданныйНаСервере()
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыделенныеСтроки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ВыделенныеСтроки Цикл
		РегистрыСведений.ВыданныеПинКодыСУО.УстановитьСнятьОтметкуВыдан(Строка.Серия, Строка.Код);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКакВыданный(Команда)
	ОтметитьКакВыданныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьПинКодНаСервере()

	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыделенныеСтроки) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ВыделенныеСтроки Цикл
		РегистрыСведений.ВыданныеПинКодыСУО.УстановтьСнятьОтметкуЗаблокирован(Строка.Серия, Строка.Код);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьПинКод(Команда)
	ЗаблокироватьПинКодНаСервере();
КонецПроцедуры

#КонецОбласти
